# St7GetNodeColours

Returns the colours used to display nodes.

long St7GetNodeColours(long uID, long* Colours, long NumCol)

Input Parameters

uID

Strand7 model file ID.

NumCol

The size of Colours.

Output Parameters
Colours[0..1]

[clNodeUnselected] – The unselected node colour.

[clNodeSelected] – The selected node colour.

See also RGB Colours.

Beam Entity Display

Beam Entity Display